app/controllers/contatos_controller.rb

  def index
    @contatos = Contato.all
---
SELECT "contatos".* FROM "contatos"

  def create
    @contato = Contato.new(contato_params)

    respond_to do |format|
      if @contato.save
---
INSERT INTO "contatos" ("Nome", "Subject", "Message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Nome", "Marcus"], ["Subject", "askdma"], ["Message", "klamsd"], ["created_at", "2017-10-24 02:38:44.646891"], ["updated_at", "2017-10-24 02:38:44.646891"]]

    def set_contato
      @contato = Contato.find(params[:id])
---
SELECT  "contatos".* FROM "contatos" WHERE "contatos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]